Sequential(
  (0): Linear(in_features=9, out_features=256, bias=True)
  (1): Linear(in_features=256, out_features=512, bias=True)
  (2): LeakyReLU(negative_slope=0.01)
  (3): Dropout(p=0.12, inplace=False)
  (4): Linear(in_features=512, out_features=1024, bias=True)
  (5): LeakyReLU(negative_slope=0.01)
  (6): Linear(in_features=1024, out_features=1024, bias=True)
  (7): GELU(approximate='none')
  (8): Linear(in_features=1024, out_features=256, bias=True)
  (9): LeakyReLU(negative_slope=0.01)
  (10): Dropout(p=0.2, inplace=False)
  (11): Linear(in_features=256, out_features=128, bias=True)
  (12): LeakyReLU(negative_slope=0.01)
  (13): Linear(in_features=128, out_features=64, bias=True)
  (14): LeakyReLU(negative_slope=0.01)
  (15): Linear(in_features=64, out_features=32, bias=True)
  (16): GELU(approximate='none')
  (17): Linear(in_features=32, out_features=32, bias=True)
  (18): LeakyReLU(negative_slope=0.05)
  (19): Linear(in_features=32, out_features=32, bias=True)
  (20): GELU(approximate='none')
  (21): Linear(in_features=32, out_features=16, bias=True)
  (22): GELU(approximate='none')
  (23): Linear(in_features=16, out_features=16, bias=True)
  (24): GELU(approximate='none')
  (25): Linear(in_features=16, out_features=1, bias=True)
)