Sequential(
  (0): Linear(in_features=9, out_features=64, bias=True)
  (1): Linear(in_features=64, out_features=128, bias=True)
  (2): GELU(approximate='none')
  (3): Linear(in_features=128, out_features=128, bias=True)
  (4): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (5): GELU(approximate='none')
  (6): Linear(in_features=128, out_features=32, bias=True)
  (7): GELU(approximate='none')
  (8): Linear(in_features=32, out_features=1, bias=True)
)