Sequential(
  (0): Linear(in_features=8, out_features=128, bias=True)
  (1): LeakyReLU(negative_slope=0.01)
  (2): Linear(in_features=128, out_features=128, bias=True)
  (3): GELU(approximate='none')
  (4): Dropout(p=0.2, inplace=False)
  (5): Linear(in_features=128, out_features=64, bias=True)
  (6): LeakyReLU(negative_slope=0.01)
  (7): Linear(in_features=64, out_features=32, bias=True)
  (8): GELU(approximate='none')
  (9): Linear(in_features=32, out_features=1, bias=True)
)