Sequential(
  (0): Linear(in_features=0, out_features=64, bias=True)
  (1): Linear(in_features=64, out_features=128, bias=True)
  (2): GELU(approximate='none')
  (3): Linear(in_features=128, out_features=512, bias=True)
  (4): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (5): GELU(approximate='none')
  (6): Linear(in_features=512, out_features=256, bias=True)
  (7): BatchNorm1d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (8): ReLU()
  (9): Dropout(p=0.3, inplace=False)
  (10): Linear(in_features=256, out_features=128, bias=True)
  (11): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (12): ReLU()
  (13): Dropout(p=0.2, inplace=False)
  (14): Linear(in_features=128, out_features=1, bias=True)
)