Sequential(
  (0): Linear(in_features=9, out_features=128, bias=True)
  (1): GELU(approximate='none')
  (2): Dropout(p=0.2, inplace=False)
  (3): Linear(in_features=128, out_features=64, bias=True)
  (4): GELU(approximate='none')
  (5): Linear(in_features=64, out_features=16, bias=True)
  (6): GELU(approximate='none')
  (7): Linear(in_features=16, out_features=1, bias=True)
)