Sequential(
  (0): Linear(in_features=9, out_features=256, bias=True)
  (1): Linear(in_features=256, out_features=512, bias=True)
  (2): LeakyReLU(negative_slope=0.01)
  (3): Linear(in_features=512, out_features=1024, bias=True)
  (4): LeakyReLU(negative_slope=0.01)
  (5): Linear(in_features=1024, out_features=256, bias=True)
  (6): LeakyReLU(negative_slope=0.01)
  (7): Dropout(p=0.2, inplace=False)
  (8): Linear(in_features=256, out_features=128, bias=True)
  (9): LeakyReLU(negative_slope=0.01)
  (10): Linear(in_features=128, out_features=64, bias=True)
  (11): LeakyReLU(negative_slope=0.01)
  (12): Linear(in_features=64, out_features=32, bias=True)
  (13): GELU(approximate='none')
  (14): Linear(in_features=32, out_features=32, bias=True)
  (15): Linear(in_features=32, out_features=32, bias=True)
  (16): GELU(approximate='none')
  (17): Linear(in_features=32, out_features=16, bias=True)
  (18): GELU(approximate='none')
  (19): Linear(in_features=16, out_features=16, bias=True)
  (20): GELU(approximate='none')
  (21): Linear(in_features=16, out_features=1, bias=True)
)