Sequential(
  (0): Linear(in_features=9, out_features=256, bias=True)
  (1): Linear(in_features=256, out_features=512, bias=True)
  (2): LeakyReLU(negative_slope=0.01)
  (3): Linear(in_features=512, out_features=1024, bias=True)
  (4): LeakyReLU(negative_slope=0.01)
  (5): Linear(in_features=1024, out_features=256, bias=True)
  (6): LeakyReLU(negative_slope=0.01)
  (7): Linear(in_features=256, out_features=128, bias=True)
  (8): LeakyReLU(negative_slope=0.01)
  (9): Linear(in_features=128, out_features=64, bias=True)
  (10): LeakyReLU(negative_slope=0.01)
  (11): Linear(in_features=64, out_features=32, bias=True)
  (12): GELU(approximate='none')
  (13): Linear(in_features=32, out_features=32, bias=True)
  (14): Linear(in_features=32, out_features=32, bias=True)
  (15): GELU(approximate='none')
  (16): Linear(in_features=32, out_features=16, bias=True)
  (17): GELU(approximate='none')
  (18): Linear(in_features=16, out_features=1, bias=True)
)